#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.function_apps.module.function_app_user_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_support_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.apim.azurerm_api_management_named_value.support_func_key will be created
  + resource "azurerm_api_management_named_value" "support_func_key" {
      + api_management_name = "io-p-apim-v2-api"
      + display_name        = "io-wallet-support-func-key"
      + id                  = (known after apply)
      + name                = "io-wallet-support-func-key"
      + resource_group_name = "io-p-rg-internal"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.apim.module.apim_v2_wallet_support_api.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-apim-v2-api"
      + api_type              = (known after apply)
      + description           = "Wallet APIs"
      + display_name          = "IO Wallet - Support"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-wallet-support-api"
      + path                  = "api/v1/wallet/support"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-rg-internal"
      + revision              = "1"
      + service_url           = "https://io-p-itn-wallet-user-func-01.azurewebsites.net/api/v1/wallet"
      + soap_pass_through     = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = jsonencode({})
        }
    }

  # module.apim.module.apim_v2_wallet_support_api.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-apim-v2-api"
      + api_name            = "io-p-wallet-support-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-rg-internal"
      + xml_content         = <<-EOT
            <policies>
              <inbound>
                  <base />
                  <set-header name="x-functions-key" exists-action="override">
                      <value>{{io-wallet-support-func-key}}</value>
                  </set-header>
              </inbound>
              <outbound>
                  <base />
              </outbound>
            </policies>
        EOT
    }

  # module.apim.module.apim_v2_wallet_support_api.azurerm_api_management_product_api.this["io-p-wallet-support-api"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-apim-v2-api"
      + api_name            = "io-p-wallet-support-api"
      + id                  = (known after apply)
      + product_id          = "io-p-wallet-support-api"
      + resource_group_name = "io-p-rg-internal"
    }

  # module.apim.module.apim_v2_wallet_support_product.azurerm_api_management_product.this will be created
  + resource "azurerm_api_management_product" "this" {
      + api_management_name   = "io-p-apim-v2-api"
      + approval_required     = false
      + description           = "Product for support Wallet API"
      + display_name          = "IO WALLET API"
      + id                    = (known after apply)
      + product_id            = "io-p-wallet-support-api"
      + published             = true
      + resource_group_name   = "io-p-rg-internal"
      + subscription_required = true
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
